<?php
/**
 * Created by TAP Co.,Ltd .
 * User: y_kishimoto
 * Date: 2020/02/17
 */

 /**
 * リクエスト関連 Configuration file
 */
return [
    /*
    |--------------------------------------------------------------------------
    | Search Condition Deleted Data
    |--------------------------------------------------------------------------
    |
    | 0: 論理削除データを含まない
    | 1: 論理削除データを含む
    |
    */
    'IN_DELETED_ITEM' => [
        'EXCLUDE' => 0,
        'INCLUDE' => 1
    ],

    /*
    |--------------------------------------------------------------------------
    | Delete Type
    |--------------------------------------------------------------------------
    |
    | 1: 論理削除
    | 2: 物理削除
    |
    */
    'DELETE_TYPE_ITEM' => [
        'LOGIC' => 1,
        'PHYSICS' => 2
    ]

];